In [2]:
import pandas as pd #Mengimport Library
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
df = pd.read_csv('Social_Network_Ads.csv')  #Mengconvert DataSet ke DataFrame
df.head() #Melihat Informasi Mengenai Data

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
df.info() #Melihat apakah ada nilai kosong pada atribut

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [4]:
data = df.drop(columns=['User ID']) #Menghapus Data Kolom User ID
data = pd.get_dummies(data) #Menjalankan Infromasi Setelah di Hapus
data

     Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0     19            19000          0              0            1
1     35            20000          0              0            1
2     26            43000          0              1            0
3     27            57000          0              1            0
4     19            76000          0              0            1
..   ...              ...        ...            ...          ...
395   46            41000          1              1            0
396   51            23000          1              0            1
397   50            20000          1              1            0
398   36            33000          0              0            1
399   49            36000          1              1            0

[400 rows x 5 columns]

In [8]:
#Memisahkan antara atribut dan tabel
predictions = ['Age', 'EstimatedSalary', 'Gender_Female', 'Gender_Male']
x = data[predictions]
y = data['Purchased']
#Membagi data antara train set dan test set
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.25, random_state=42)
#Melatih Model dengan train set
from sklearn import linear_model
model = linear_model.LogisticRegression()
model.fit(x_train, y_train)
#Menguji Akurasi pada test set
model.score(x_test, y_test)

0.63